import { type _howToSchema } from "./how-to";

export const howToSchema: _howToSchema = {
    "@context": "https://schema.org",
    "@type": "HowTo",
    name: "PDF को कैसे मर्ज करें",
    description:
        "एक से अधिक PDF फ़ाइलों को एक में मर्ज करने के लिए स्टेप-बाय-स्टेप गाइड।",
    step: [
        {
            "@type": "HowToStep",
            name: "स्टेप 1",
            text: "PDFEquips पर पीडीएफ़ मर्ज टूल खोलें।",
        },
        {
            "@type": "HowToStep",
            name: "स्टेप 2",
            text: "पीडीएफ़ फ़ाइलें खींचें और छोड़ें या 'पीडीएफ़ फ़ाइलें चुनें' बटन पर क्लिक करके पीडीएफ़ फ़ाइलें जोड़ें।",
        },
        {
            "@type": "HowToStep",
            name: "स्टेप 3",
            text: "एक फ़ाइल पर क्लिक करें और रखें, उसे चाहिए स्थान पर ले जाएं और छोड़ें।",
        },
        {
            "@type": "HowToStep",
            name: "स्टेप 4",
            text: "पीडीएफ़ फ़ाइलें ऊपर से नीचे मर्ज होती हैं।",
        },
        {
            "@type": "HowToStep",
            name: "स्टेप 5",
            text: "फ़ाइल को हटाने के लिए, फ़ाइल के ऊपरी हिस्से में हटाने वाले आइकन पर क्लिक करें।",
        },
        {
            "@type": "HowToStep",
            name: "स्टेप 6",
            text: "पेज को घूमाने के लिए, पेज के संक्षेप में ऊपरी हिस्से में घूमाने वाले आइकन पर क्लिक करें और चाहिए घूमाने का कोण चुनें।",
        },
        {
            "@type": "HowToStep",
            name: "स्टेप 7",
            text: "जब फ़ाइलें वांछित क्रम और दिशा में हों तो, उन्हें एक ही पीडीएफ़ फ़ाइल में मिलाने के लिए 'मर्ज' बटन पर क्लिक करें।",
        },
    ],
}