// import type {
//   tool as _tool,
//   web2pdftool as _web2pdftool,
//   tools as _tools,
//   edit_page as _edit_page,
//   footer as _footer,
//   errors as _errors,
//   downloadFile as _downloadFile,
//   landing_page as _landing_page,
// } from "../content";

// export const landing_page: _landing_page = {
//   hero: {
//     title: "हमारे व्यापक पीडीएफ समाधान के साथ अपनी उत्पादकता बढ़ाएँ",
//     description:
//       "अपने पीडीएफ वर्कफ़्लो को अगले स्तर पर ले जाएं - हमारे व्यापक टूलकिट के साथ नई संभावनाओं को अनलॉक करें।",
//   },
//   features: {
//     title: "PDFEquips आपके PDF कार्यों को कैसे सरल बना सकता है",
//     description:
//       "PDFEquips आपको अपनी PDF फ़ाइलों को आसानी से संभालने के लिए कई सुविधाएं प्रदान करता है। चाहे आप अपने PDF को मर्ज, स्प्लिट, कम्प्रेस, कन्वर्ट, एडिट या प्रोटेक्ट करना चाहते हो, आप कुछ ही क्लिक में सब कुछ कर सकते हो। PDFEquips तेज, विश्वसनीय और सुरक्षित है।",
//   },
//   why_us: {
//     title: "PDF समाधान जिस पर आप भरोसा कर सकते हैं",
//     description:
//       "PDFEquips आपका अंतिम वेब ऐप है जो PDF को आसानी से प्रबंधित करता है। आपके डिजिटल दस्तावेजों के साथ कुशलता से काम करने के लिए आपको जरूरत होने वाले सभी\
//     सुविधाओं का आनंद लें\
//     अपने डेटा को सुरक्षित और सुरक्षा में रखते हुए।",
//   },
// };

// export const tool: _tool = {
//   Merge_PDF: {
//     title: "पीडीएफ विलय",
//     seoTitle: "पीडीएफ विलय - कई फाइलों को एक में जोड़ें",
//     description: "एक दस्तावेज में कई पीडीएफ फ़ाइलों को जोड़ें",
//     color: "var(--red)",
//     type: ".pdf",
//     to: "/merge-pdf",
//     features: [
//       {
//         title: "पूरी तरह से मुफ्त और पंजीकरण के बिना",
//         description: "PDFEquips एक मुफ्त ऑनलाइन PDF मर्जिंग सेवा प्रदान करता है खाता बनाना आवश्यक नहीं है, और हम कभी आपसे आपके ईमेल पते या क्रेडिट कार्ड जानकारी के लिए नहीं पूछते"
//       },
//       {
//         title: "PDF फ़ाइलों को मर्ज करने के लिए मजबूत टूल",
//         description: "PDFEquips आसानी से एक फ़ाइल में दो या दो से अधिक PDF दस्तावेज़ों को मिला सकता है, चाहे वह एक ही पृष्ठ हो या कई पृष्ठ, बड़ी या छोटी PDF फ़ाइलें हों, सभी प्रारूप संगत हैं"
//       },
//       {
//         title: "ऑनलाइन पीडीएफ फ़ाइलों को सुरक्षित रूप से मर्ज करें",
//         description: "हमारे सर्वर पर आपके अपलोड और बनाए गए सभी फ़ाइलें सुरक्षा कारणों के लिए TLS का उपयोग करके एन्क्रिप्ट की जाती हैं वे प्रसंस्करण के बाद तुरंत और स्थायी रूप से हटा दी जाएंगी अधिक जानकारी के लिए, कृपया हमारी गोपनीयता नीति को देखें"
//       }
//     ],
//     keywords: "PDF मर्ज करें, PDF मर्ज उपकरण, PDF फाइलें मर्ज करें, PDF दस्तावेज़ मर्ज करें, ऑनलाइन PDF मर्ज करें, बिना रजिस्ट्रेशन के PDF मर्ज करें, मुफ्त में PDF मर्ज करें, कई PDF फाइलें मर्ज करें, जल्दी से PDF मर्ज करें, सुरक्षित रूप से PDF मर्ज करें, आसानी से PDF दस्तावेज़ मर्ज करें, मुफ्त में ऑनलाइन PDF मर्ज करें, बिना इंस्टॉलेशन के PDF मर्ज करें, एन्क्रिप्टेड PDF फाइलें मर्ज करें, मुफ्त PDF मर्ज उपकरण, बिना रजिस्ट्रेशन के ऑनलाइन PDF मर्ज करें"
//   },
//   Compress_PDF: {
//     title: "पीडीएफ कम्प्रेस करें",
//     seoTitle: "पीडीएफ कम्प्रेस करें - गुणवत्ता बनाए रखते हुए आकार कम करें",
//     description: "गुणवत्ता को बनाए रखते हुए एक पीडीएफ फ़ाइल का आकार कम करें",
//     color: "var(--green)",
//     type: ".pdf",
//     to: "/compress-pdf",
//     features: [
//       {
//         title: "बहुउपयोगी PDF संक्षेप",
//         description: "प्रत्येक बार जिस पर आप भरोसा कर सकते हैं, तेज़ और विश्वसनीय परिणाम प्राप्त करें, अपनी फ़ाइल का आकार समायोजित करने के लिए कई संक्षेप स्तरों में से चुनें जिससे आपके दस्तावेज़ की गुणवत्ता पर कोई असर न हो"
//       },
//       {
//         title: "ईमेल पंजीकरण की जरूरत नहीं",
//         description: "तुरंत अपने PDF फ़ाइलों को संक्षेपित करना शुरू करें - कोई ईमेल साइन-अप की आवश्यकता नहीं है, कोई क्रेडिट कार्ड विवरण की आवश्यकता नहीं है, बस अपने दस्तावेज़ को अपलोड करें और आवश्यकतानुसार संक्षेपित करें"
//       },
//       {
//         title: "हमेशा गुणवत्ता को बनाए रखना",
//         description: "PDFEquips आपके PDF में छवियों का आकार और गुणवत्ता दोनों को संक्षेपित करने के लिए उन्नत प्रौद्योगिकी का उपयोग करता है इससे यह सुनिश्चित होता है कि आप अपने दस्तावेज़ की निष्पक्षता को कम करते हुए काफ़ी छोटे फ़ाइल आकार प्राप्त करते हैं"
//       }
//     ],
//     keywords: "PDF संपीड़ित करें, PDF संपीड़न उपकरण, PDF का आकार कम करें, PDF दस्तावेज़ संपीड़ित करें, ऑनलाइन PDF संपीड़ित करें, बिना रजिस्ट्रेशन के PDF संपीड़ित करें, मुफ्त में PDF संपीड़ित करें, PDF फाइलों का आकार कम करें, जल्दी से PDF संपीड़ित करें, उच्च गुणवत्ता में PDF संपीड़ित करें, बिना गुणवत्ता खोए PDF संपीड़ित करें, ऑनलाइन PDF दस्तावेज़ संपीड़ित करें, बिना इंस्टॉलेशन के PDF संपीड़ित करें, मुफ्त PDF संपीड़न उपकरण, बिना रजिस्ट्रेशन के ऑनलाइन PDF संपीड़ित करें"
//   },
//   PDF_to_Powerpoint: {
//     title: "PDF से पावरपॉइंट में",
//     seoTitle: "PDF से पावरपॉइंट - संपादनीय प्रस्तुतियों में बदलें",
//     description: "PDF फ़ाइलों को संपादनीय पावरपॉइंट प्रस्तुतियों में बदलें",
//     color: "#C13B1B",
//     type: ".pdf",
//     to: "/pdf-to-powerpoint",
//     features: [
//       {
//         title: "एक क्लिक में PDF को पावरपॉइंट में बदलें",
//         description: "हमारे ऑनलाइन कनवर्टर का उपयोग करके त्वरित रूप से PDF दस्तावेज़ को पावरपॉइंट प्रस्तुतियों में परिवर्तित करें, सुनिश्चित करें कि साझा करना और भंडारण आसान हो। सभी स्लाइडों का मूल फ़ॉर्मेटिंग और लेआउट बनाए रखें।"
//       },
//       {
//         title: "PDF को पावरपॉइंट में त्वरित और मुफ्त में बदलें",
//         description: "PDFEquips केवल कुछ ही सेकंड में PDF फ़ाइलों को पावरपॉइंट PPT (ppt या pptx) प्रारूप में परिवर्तित करता है। इसके अलावा, यह पूरी तरह से मुफ्त ऑनलाइन उपकरण है जिसके लिए कोई स्थापना या लॉगिन की आवश्यकता नहीं है, और इसमें वॉटरमार्क नहीं होता है।"
//       },
//       {
//         title: "PDF से पावरपॉइंट में सरल परिवर्तन",
//         description: "हमारे PDF से पावरपॉइंट कनवर्टर के साथ, आपको सेटिंग्स और विकल्पों के माध्यम से नेविगेट करने की आवश्यकता नहीं है। बस फ़ाइल अपलोड करें, पीछे हट जाएं, आराम करें, और शो का आनंद लें!"
//       }
//     ],
//     keywords: "PDF से PowerPoint, PDF को PowerPoint में बदलें, PDF को PPT में बदलें, PDF को PPTX में बदलें, PDF से PowerPoint बदलने के उपकरण, PDF दस्तावेज़ों को PowerPoint में बदलें, PDF को प्रेजेंटेशन में बदलें, ऑनलाइन PDF बदलें, मुफ्त में PDF को PowerPoint में बदलें, बिना रजिस्ट्रेशन के PDF को PPT में बदलें, जल्दी से PDF बदलें, बिना वॉटरमार्क के PDF बदलें, PDF से PowerPoint बदलने के ऑनलाइन उपकरण"
//   },
//   WORD_to_PDF: {
//     title: "वर्ड से पीडीएफ में",
//     seoTitle: "वर्ड से पीडीएफ - वर्ड फाइलों को बदलें",
//     description: "माइक्रोसॉफ्ट वर्ड फ़ाइलों को पीडीएफ दस्तावेजों में बदलें",
//     color: "#1B5EBE",
//     type: ".docx",
//     to: "/word-to-pdf",
//     features: [
//       {
//         title: "उपयोग में आसान",
//         description: "चाहे आप कार्यकर्ता हों, छात्र हों, या शिक्षक हों - हमारे PDF उपकरण उपयोग में आसान होते हैं। वर्ड फ़ाइलों को पीडीएफ़ दस्तावेज़ में बदलना सरल है और कुछ ही क्लिक में हो जाता है।"
//       },
//       {
//         title: "सरल और तेज़ परिवर्तन",
//         description: "मूल लेआउट और स्टाइल को संरक्षित रखने के लिए उसकी उन्नत विधि का धन्यवाद, PDFEquips सुनिश्चित करता है कि वर्ड से पीडीएफ़ में संवर्धन स्मूद हो। दस्तावेज़ की पूर्णता को खोखले किए बिना तेज़ क्रियाएँ का आनंद लें।"
//       },
//       {
//         title: "एक वर्ड फ़ाइल या कई वर्ड फ़ाइलें परिवर्तित करें",
//         description: "PDFEquips का उपयोग करके आप एक या कई वर्ड फ़ाइलों को बिना किसी परेशानी के आसानी से परिवर्तित कर सकते हैं। हमारे सीधे उपकरण त्वरित और सटीक परिवर्तन सुनिश्चित करते हैं, आपको समय और परिश्रम बचाते हैं।"
//       }
//     ],
//     keywords: "WORD से PDF, WORD को PDF में बदलें, Word दस्तावेज़ों को PDF में बदलें, Word फाइलों को PDF में बदलें, Word से PDF बदलने के उपकरण, ऑनलाइन Word को PDF में बदलें, मुफ्त में Word को PDF में बदलें, जल्दी से Word बदलें, बिना रजिस्ट्रेशन के Word बदलें, बिना फॉर्मेट खोए Word को PDF में बदलें, आसानी से Word दस्तावेज़ों को PDF में बदलें, बिना इंस्टॉलेशन के Word फाइलों को PDF में बदलें, मुफ्त में Word से PDF बदलने के उपकरण"
//   },
//   POWERPOINT_to_PDF: {
//     title: "पावरपॉइंट से पीडीएफ में",
//     seoTitle: "पावरपॉइंट से पीडीएफ - फाइलों को बदलें",
//     description: "माइक्रोसॉफ्ट पावरपॉइंट फाइलों को पीडीएफ दस्तावेजों में बदलें",
//     color: "#C13B1B",
//     type: ".pptx",
//     to: "/powerpoint-to-pdf",
//     features: [
//       {
//         title: "Convert PowerPoint to PDF with a Single Click",
//         description: "Quickly convert PowerPoint presentations to PDF documents using our online converter, ensuring easy sharing and storage Maintain the original formatting and layout of all slides"
//       },
//       {
//         title: "Convert Powerpoint to PDF quickly and for free",
//         description: "PDFEquips converts PowerPoint PPT (ppt or pptx) files to PDF in just a few seconds Plus, it's a completely free online tool that doesn't require any installation or login, and it doesn't have watermarks"
//       },
//       {
//         title: "Simple Conversion from PowerPoint to PDF",
//         description: "With our PPT to PDF converter, you don't have to navigate through settings and options Just upload the file, sit back, relax, and enjoy the show!"
//       }
//     ],
//     keywords: "POWERPOINT से PDF, PowerPoint को PDF में बदलें, PowerPoint दस्तावेज़ों को PDF में बदलें, PowerPoint प्रेजेंटेशन को PDF में बदलें, PowerPoint से PDF बदलने के उपकरण, ऑनलाइन PowerPoint को PDF में बदलें, मुफ्त में PowerPoint को PDF में बदलें, जल्दी से PowerPoint बदलें, बिना रजिस्ट्रेशन के PowerPoint बदलें, बिना फॉर्मेट खोए PowerPoint को PDF में बदलें, आसानी से PowerPoint प्रेजेंटेशन को PDF में बदलें, बिना इंस्टॉलेशन के PowerPoint फाइलों को PDF में बदलें, मुफ्त में PowerPoint से PDF बदलने के उपकरण"
//   },
//   EXCEL_to_PDF: {
//     title: "एक्सेल से पीडीएफ में",
//     seoTitle: "एक्सेल से पीडीएफ - फाइलों को बदलें",
//     description: "माइक्रोसॉफ्ट एक्सेल फ़ाइलों को पीडीएफ दस्तावेजों में बदलें",
//     color: "#10793F",
//     type: ".xlsx",
//     to: "/excel-to-pdf",
//     features: [
//       {
//         title: "एक्सेल से पीडीएफ़ में आसान उपयोगकर्ता कनवर्टर",
//         description: "एक उपयुक्त कनवर्टर जो एक्सेल (XLS, XLSX) फ़ाइलें पीडीएफ़ प्रारूप में बदलने के लिए है, इसका उपयोग साझा करने और सुरक्षित रूप से संग्रहीत करने को सरल बनाता है। अपने डेटा को परिवर्तनों से सुरक्षित रखें और किसी भी उपकरण पर अपनी एक्सेल फ़ाइलों तक पहुँचें, चाहे आपके पास माइक्रोसॉफ्ट ऑफ़िस हो या न हो।"
//       },
//       {
//         title: "तेज़ और मुफ्त ऑनलाइन कनवर्शन उपकरण",
//         description: "PDFEquips एक पूरी तरह से मुफ्त ऑनलाइन उपकरण है जो एक्सेल (XLS या XLSX) फ़ाइलों को पीडीएफ़ में बदलने के लिए है कोई स्थापना या साइन-अप की आवश्यकता नहीं है, और कोई वॉटरमार्क नहीं जोड़े जाते हैं साथ ही, यह बड़ी एक्सेल फ़ाइलों को कुछ ही सेकंडों में बदलता है"
//       },
//       {
//         title: "XLS से पीडीएफ़ में सुरक्षित परिवर्तन",
//         description: "आपकी फ़ाइलें मजबूत TLS एन्क्रिप्शन (परिवहन परत सुरक्षा) के साथ संरक्षित होती हैं, और सभी एक्सेल और पीडीएफ़ फ़ाइलें हमारे सर्वरों से एक घंटे के बाद स्वचालित रूप से हटा दी जाती हैं। अधिक जानकारी के लिए, कृपया हमारी गोपनीयता नीति का उल्लेख करें।"
//       }
//     ],
//     keywords: "EXCEL से PDF, Excel को PDF में बदलें, Excel दस्तावेज़ों को PDF में बदलें, Excel फाइलों को PDF में बदलें, Excel से PDF बदलने के उपकरण, ऑनलाइन Excel को PDF में बदलें, मुफ्त में Excel को PDF में बदलें, जल्दी से Excel बदलें, बिना रजिस्ट्रेशन के Excel बदलें, बिना फॉर्मेट खोए Excel को PDF में बदलें, आसानी से Excel शीटों को PDF में बदलें, बिना इंस्टॉलेशन के Excel फाइलों को PDF में बदलें, मुफ्त में Excel से PDF बदलने के उपकरण"
//   },
//   HTML_to_PDF: {
//     title: "HTML से पीडीएफ में",
//     seoTitle: "HTML से पीडीएफ - वेब पृष्ठों को बदलें",
//     description: "HTML वेब पृष्ठों को पीडीएफ दस्तावेजों में बदलें",
//     color: "rgb(228, 77, 38)",
//     type: ".html",
//     to: "/html-to-pdf",
//     features: [
//       {
//         title: "तुरंत परिवर्तन, कोई साइन-अप की आवश्यकता नहीं है।",
//         description: "अपने HTML को पीडीएफ़ में परिवर्तित करने के लिए कोई पंजीकरण करने या कोई जानकारी प्रदान करने की आवश्यकता नहीं है। हमारा कनवर्टर सभी के लिए मुफ्त है और त्वरित परिणाम प्रदान करता है।"
//       },
//       {
//         title: "सुरक्षित दस्तावेज प्रबंधन।",
//         description: "आपके डाउनलोड और उत्पन्न पीडीएफ़ फ़ाइलें अतिरिक्त सुरक्षा के लिए TLS एन्क्रिप्शन के साथ प्रसंस्कृत की जाती हैं। आपके डेटा की गोपनीयता सुनिश्चित है। अधिक जानकारी के लिए हमारी गोपनीयता नीति की जाँच करें।"
//       },
//       {
//         title: "क्लाउड-आधारित प्रोसेसिंग।",
//         description: "HTML से पीडीएफ़ में परिवर्तन के लिए क्लाउड-आधारित प्रोसेसिंग का आनंद लें। हमारी ऑनलाइन सेवा सुनिश्चित करती है कि आपका कंप्यूटर धीमा नहीं होता है, तेज़ और कुशल परिवर्तन होता है। किसी भी समय और कहीं से भी हमारी सेवा तक पहुँचें।"
//       }
//     ],
//     keywords: "HTML से PDF, HTML को PDF में बदलें, वेब पेजों को PDF में बदलें, HTML फाइलों को PDF में बदलें, HTML से PDF बदलने के उपकरण, ऑनलाइन HTML को PDF में बदलें, मुफ्त में HTML को PDF में बदलें, जल्दी से HTML बदलें, बिना रजिस्ट्रेशन के HTML बदलें, बिना फॉर्मेट खोए वेब पेजों को PDF में बदलें, आसानी से HTML को PDF दस्तावेज़ों में बदलें, बिना इंस्टॉलेशन के HTML फाइलों को PDF में बदलें, मुफ्त में HTML से PDF बदलने के उपकरण"
//   },
//   PDF_to_WORD: {
//     title: "PDF से वर्ड में",
//     seoTitle: "PDF से वर्ड - फाइलों को बदलें",
//     description: "PDF फ़ाइलों को माइक्रोसॉफ्ट वर्ड दस्तावेजों में बदलें",
//     color: "#1B5EBE",
//     type: ".pdf",
//     to: "/pdf-to-word",
//     features: [
//       {
//         title: "सरल और तेज़ परिवर्तन",
//         description: "मूल लेआउट और शैलियों को संरक्षित रखने के उसकी उन्नत विधि का धन्यवाद, PDFEquips सुनिश्चित करता है कि पीडीएफ़ से वर्ड में संवर्धन स्मूद हो। दस्तावेज़ की पूर्णता को खोखले किए बिना तेज़ क्रियाएँ का आनंद लें।"
//       },
//       {
//         title: "उपयोग में आसान",
//         description: "आपके भूमिका के बावजूद - चाहे आप कामकाजी हों, छात्र हों, या शिक्षक हों - हमारे पीडीएफ़ उपकरण उपयोग में आसान होते हैं। पीडीएफ़ फ़ाइलों को वर्ड दस्तावेज़ में परिवर्तित करना सरल है और कुछ ही क्लिक में हो जाता है।"
//       },
//       {
//         title: "एक पीडीएफ़ फ़ाइल या कई पीडीएफ़ फ़ाइलें परिवर्तित करें",
//         description: "आप PDFEquips का उपयोग करके एक या कई पीडीएफ़ फ़ाइलों को बिना किसी परेशानी के आसानी से परिवर्तित कर सकते हैं। हमारे सीधे उपकरण त्वरित और सटीक परिवर्तन सुनिश्चित करते हैं, जिससे आपको समय और परिश्रम बचती है।"
//       }
//     ],
//     keywords: "PDF से WORD, PDF को Word में बदलें, PDF दस्तावेज़ों को Word में बदलें, PDF फाइलों को Word में बदलें, PDF से Word बदलने के उपकरण, ऑनलाइन PDF को Word में बदलें, मुफ्त में PDF को Word में बदलें, जल्दी से PDF बदलें, बिना रजिस्ट्रेशन के PDF बदलें, बिना फॉर्मेट खोए PDF को Word में बदलें, आसानी से PDF दस्तावेज़ों को Word में बदलें, बिना इंस्टॉलेशन के PDF फाइलों को Word में बदलें, मुफ्त में PDF से Word बदलने के उपकरण"
//   },
//   PDF_to_EXCEL: {
//     title: "PDF से एक्सेल में",
//     seoTitle: "PDF से एक्सेल - फाइलों को बदलें",
//     description: "PDF फ़ाइलों को माइक्रोसॉफ्ट एक्सेल दस्तावेजों में बदलें",
//     color: "#10793F",
//     type: ".pdf",
//     to: "/pdf-to-excel",
//     features: [
//       {
//         title: "तेज़ और मुफ्त ऑनलाइन कनवर्शन उपकरण",
//         description: "PDFEquips एक पूरी तरह से मुफ्त ऑनलाइन उपकरण है जो पीडीएफ़ फ़ाइलों को एक्सेल (XLS या XLSX) में परिवर्तित करने के लिए है कोई स्थापना या साइन-अप की आवश्यकता नहीं है, और कोई वॉटरमार्क नहीं जोड़े जाते हैं। साथ ही, यह बड़ी पीडीएफ़ फ़ाइलों को कुछ ही सेकंडों में बदलता है।"
//       },
//       {
//         title: "पीडीएफ़ से एक्सेल के लिए सरल और उपयोग में आसान कनवर्टर",
//         description: "एक उपयुक्त कनवर्टर जो पीडीएफ़ फ़ाइलों को XLS या XLSX प्रारूप में परिवर्तित करने के लिए है, इसका उपयोग साझा करने और सुरक्षित रूप से संग्रहीत करने को सरल बनाता है। अपने डेटा को परिवर्तनों से सुरक्षित रखें और किसी भी उपकरण पर अपनी एक्सेल फ़ाइलों तक पहुँचें, चाहे आपके पास माइक्रोसॉफ्ट ऑफ़िस हो या न हो।"
//       },
//       {
//         title: "पीडीएफ़ से XLS में सुरक्षित परिवर्तन",
//         description: "आपकी फ़ाइलें मजबूत TLS एन्क्रिप्शन (परिवहन परत सुरक्षा) के साथ संरक्षित होती हैं, और सभी पीडीएफ़ और एक्सेल फ़ाइलें हमारे सर्वरों से एक घंटे के बाद स्वचालित रूप से हटा दी जाती हैं। अधिक जानकारी के लिए, कृपया हमारी गोपनीयता नीति का उल्लेख करें।"
//       }
//     ],
//     keywords: "PDF से EXCEL, PDF को Excel में बदलें, PDF दस्तावेज़ों को Excel में बदलें, PDF फाइलों को Excel में बदलें, PDF से Excel बदलने के उपकरण, ऑनलाइन PDF को Excel में बदलें, मुफ्त में PDF को Excel में बदलें, जल्दी से PDF बदलें, बिना रजिस्ट्रेशन के PDF बदलें, बिना फॉर्मेट खोए PDF को Excel में बदलें, आसानी से PDF तालिकाओं को Excel में बदलें, बिना इंस्टॉलेशन के PDF फाइलों को Excel में बदलें, मुफ्त में PDF से Excel बदलने के उपकरण"
//   },
//   PDF_to_PDF_A: {
//     title: "PDF से PDF/A में",
//     seoTitle: "PDF से PDF/A - लंबे समय के लिए संचय करें",
//     description: "PDF फ़ाइलों को लंबे समय तक संचय के लिए PDF/A प्रारूप में बदलें",
//     color: "#000000",
//     type: ".pdf",
//     to: "/pdf-to-pdf-a",
//     features: [
//       {
//         title: "दस्तावेज़ों की अखंडता को बनाए रखें",
//         description: "अपनी पीडीएफ़ फ़ाइलें पीडीएफ़/ए फ़ार्मेट में परिवर्तित करें और सुनिश्चित करें कि दस्तावेज़ की अखंडता, सामग्री, संरचना, और उपस्थिति, सहित सभी जानकारी को संरक्षित रखा जाता है"
//       },
//       {
//         title: "आर्काइविंग मानकों का पालन",
//         description: "अपनी पीडीएफ़ दस्तावेज़ों को पीडीएफ़/ए फ़ार्मेट में परिवर्तित करके आर्काइविंग मानकों का पालन सुनिश्चित करें, जो दीर्घकालिक भंडारण और कानूनी आवश्यकताओं के लिए उपयुक्त है"
//       },
//       {
//         title: "लंबे समय तक पहुंचने और संगतता",
//         description: "अपनी पीडीएफ़ फ़ाइलों को पीडीएफ़/ए फ़ार्मेट में परिवर्तित करके, आप लंबे समय तक पहुंचने और भविष्य के सॉफ़्टवेयर और प्रणालियों के संगतता को सुनिश्चित करते हैं, जबकि प्रारूप पुराना होने का जोखिम कम होता है"
//       }
//     ],
//     keywords: "PDF से PDF/A, PDF को PDF/A में बदलें, PDF दस्तावेज़ों को PDF/A में बदलें, PDF फाइलों को PDF/A में बदलें, PDF से PDF/A बदलने के उपकरण, ऑनलाइन PDF को PDF/A में बदलें, मुफ्त में PDF को PDF/A में बदलें, जल्दी से PDF बदलें, बिना रजिस्ट्रेशन के PDF बदलें, बिना फॉर्मेट खोए PDF को PDF/A में बदलें, आसानी से PDF दस्तावेज़ों को PDF/A में बदलें, बिना इंस्टॉलेशन के PDF फाइलों को PDF/A में बदलें, मुफ्त में PDF से PDF/A बदलने के उपकरण"
//   },
//   PDF_to_Text: {
//     title: "पीडीएफ से टेक्स्ट",
//     seoTitle: "पीडीएफ से टेक्स्ट - सामान्य टेक्स्ट में बदलें",
//     description: "पीडीएफ फाइल को सामान्य टेक्स्ट दस्तावेज में रूपांतरित करें",
//     color: "#4493e1",
//     type: ".pdf",
//     to: "/pdf-to-text",
//     features: [
//       {
//         title: "मजबूत और सटीक परिवर्तन",
//         description: "मजबूत और सटीक परिवर्तन क्षमताओं से लाभ उठाएं, जो पीडीएफ़ दस्तावेज़ों से पाठ सामग्री को उच्च-गुणवत्ता से निकालने की सुनिश्चित करते हैं, जैसे कि अल-अरबीया जैसी विभिन्न भाषाओं का समर्थन।"
//       },
//       {
//         title: "फास्ट प्रोसेसिंग",
//         description: "हमारे पीडीएफ़ से पाठ कनवर्टर के साथ तेज़ प्रोसेसिंग गतियों का अनुभव करें, जो पीडीएफ़ फ़ाइलों को साधारण पाठ प्रारूप में तेज़ी से परिवर्तित करता है बिना सटीकता को कम किये।"
//       },
//       {
//         title: "दस्तावेज़ संरचना का संरक्षण",
//         description: "दस्तावेज़ संरचना और स्वरूप को संरक्षित रखते हुए पीडीएफ़ फ़ाइलों को साधारण पाठ में परिवर्तित करें, जिससे निकाले गए पाठ सामग्री की पठनीयता और उपयोगिता सुनिश्चित हो।"
//       }
//     ],
//     keywords: "PDF को टेक्स्ट में बदलें, PDF को टेक्स्ट दस्तावेज़ में बदलें, PDF दस्तावेज़ों को टेक्स्ट में बदलें, PDF फाइलों को टेक्स्ट में बदलें, PDF से टेक्स्ट बदलने के उपकरण, ऑनलाइन PDF को टेक्स्ट में बदलें, मुफ्त में PDF को टेक्स्ट में बदलें, जल्दी से PDF बदलें, बिना रजिस्ट्रेशन के PDF बदलें, बिना फॉर्मेट खोए PDF को टेक्स्ट में बदलें, आसानी से PDF से टेक्स्ट निकालें, बिना इंस्टॉलेशन के PDF फाइलों को टेक्स्ट में बदलें, मुफ्त में PDF से टेक्स्ट बदलने के उपकरण"
//   }
// }

// export const downloadFile: _downloadFile = {
//   titles: {
//     "merge-pdf": [
//       "PDF फ़ाइलें मर्ज़ की गई हैं!",
//       "PDF फ़ाइल को मर्ज़ किया गया है!",
//     ],
//     "split-pdf": ["PDF फ़ाइल को विभाजित किया गया है!"],
//     "compress-pdf": [
//       "PDF फ़ाइलें संपीड़ित की गई हैं!",
//       "PDF फ़ाइल को संपीड़ित किया गया है!",
//     ],
//     "pdf-to-powerpoint": [
//       "PDF फ़ाइलें पावरपॉइंट में रूपांतरित की गईं!",
//       "PDF फ़ाइल को पावरपॉइंट में रूपांतरित किया गया है!",
//     ],
//     "word-to-pdf": [
//       "वर्ड फ़ाइलें PDF में रूपांतरित की गईं!",
//       "वर्ड फ़ाइल को PDF में रूपांतरित किया गया है!",
//     ],
//     "powerpoint-to-pdf": [
//       "पावरपॉइंट फ़ाइलें PDF में रूपांतरित की गईं!",
//       "पावरपॉइंट फ़ाइल को PDF में रूपांतरित किया गया है!",
//     ],
//     "excel-to-pdf": [
//       "एक्सेल फ़ाइलें PDF में रूपांतरित की गईं!",
//       "एक्सेल फ़ाइल को PDF में रूपांतरित किया गया है!",
//     ],
//     "html-to-pdf": [
//       "HTML फ़ाइलें PDF में रूपांतरित की गईं!",
//       "HTML फ़ाइल को PDF में रूपांतरित किया गया है!",
//     ],
//     "pdf-to-word": [
//       "PDF फ़ाइलें वर्ड में रूपांतरित की गईं!",
//       "PDF फ़ाइल को वर्ड में रूपांतरित किया गया है!",
//     ],
//     "pdf-to-excel": [
//       "PDF फ़ाइलें एक्सेल में रूपांतरित की गईं!",
//       "PDF फ़ाइल को एक्सेल में रूपांतरित किया गया है!",
//     ],
//     "pdf-to-pdf-a": [
//       "PDF फ़ाइलें PDF/A में रूपांतरित की गईं!",
//       "PDF फ़ाइल को PDF/A में रूपांतरित किया गया है!",
//     ],
//     "pdf-to-text": [
//       "PDF फ़ाइलें टेक्स्ट में रूपांतरित की गईं!",
//       "PDF फ़ाइल को टेक्स्ट में रूपांतरित किया गया है!",
//     ],
//   },
//   btnText: {
//     "merge-pdf": [
//       "मर्ज़ की गई PDF फ़ाइलें डाउनलोड करें",
//       "मर्ज़ की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "split-pdf": [
//       "विभाजित की गई PDF फ़ाइलें डाउनलोड करें",
//       "विभाजित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "compress-pdf": [
//       "संपीड़ित की गई PDF फ़ाइलें डाउनलोड करें",
//       "संपीड़ित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "pdf-to-powerpoint": [
//       "पावरपॉइंट में रूपांतरित की गई PDF फ़ाइलें डाउनलोड करें",
//       "पावरपॉइंट में रूपांतरित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "word-to-pdf": [
//       "PDF में रूपांतरित की गई वर्ड फ़ाइलें डाउनलोड करें",
//       "PDF में रूपांतरित की गई वर्ड फ़ाइल डाउनलोड करें",
//     ],
//     "powerpoint-to-pdf": [
//       "PDF में रूपांतरित की गई पावरपॉइंट फ़ाइलें डाउनलोड करें",
//       "PDF में रूपांतरित की गई पावरपॉइंट फ़ाइल डाउनलोड करें",
//     ],
//     "excel-to-pdf": [
//       "PDF में रूपांतरित की गई एक्सेल फ़ाइलें डाउनलोड करें",
//       "PDF में रूपांतरित की गई एक्सेल फ़ाइल डाउनलोड करें",
//     ],
//     "html-to-pdf": [
//       "PDF में रूपांतरित की गई HTML फ़ाइलें डाउनलोड करें",
//       "PDF में रूपांतरित की गई HTML फ़ाइल डाउनलोड करें",
//     ],
//     "pdf-to-word": [
//       "वर्ड में रूपांतरित की गई PDF फ़ाइलें डाउनलोड करें",
//       "वर्ड में रूपांतरित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "pdf-to-excel": [
//       "एक्सेल में रूपांतरित की गई PDF फ़ाइलें डाउनलोड करें",
//       "एक्सेल में रूपांतरित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "pdf-to-pdf-a": [
//       "PDF/A में रूपांतरित की गई PDF फ़ाइलें डाउनलोड करें",
//       "PDF/A में रूपांतरित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//     "pdf-to-text": [
//       "टेक्स्ट में रूपांतरित की गई PDF फ़ाइलें डाउनलोड करें",
//       "टेक्स्ट में रूपांतरित की गई PDF फ़ाइल डाउनलोड करें",
//     ],
//   },
//   backto: {
//     "merge-pdf": "मर्ज़ की गई PDF को वापस जाएं",
//     "split-pdf": "विभाजित की गई PDF को वापस जाएं",
//     "compress-pdf": "संपीड़ित की गई PDF को वापस जाएं",
//     "pdf-to-powerpoint": "पीडीएफ से पावरपॉइंट को वापस जाएं",
//     "word-to-pdf": "वर्ड से PDF को वापस जाएं",
//     "powerpoint-to-pdf": "पावरपॉइंट से PDF को वापस जाएं",
//     "excel-to-pdf": "एक्सेल से PDF को वापस जाएं",
//     "html-to-pdf": "HTML से PDF को वापस जाएं",
//     "pdf-to-word": "PDF से वर्ड को वापस जाएं",
//     "pdf-to-excel": "PDF से एक्सेल को वापस जाएं",
//     "pdf-to-pdf-a": "PDF से पीडीएफ-ए को वापस जाएं",
//     "pdf-to-text": "PDF से टेक्स्ट को वापस जाएं",
//   },
// };

// export const edit_page: _edit_page = {
//   edit_page_titles: {
//     merge_pdf: "PDF फ्यूज़न विकल्प",
//     split_pdf: "PDF विभाजन विकल्प",
//     compress_pdf: "PDF संपीड़न विकल्प",
//     pdf_to_powerpoint: "PDF से पावरपॉइंट विकल्प",
//     word_to_pdf: "WORD से PDF विकल्प",
//     powerpoint_to_pdf: "पावरपॉइंट से PDF विकल्प",
//     excel_to_pdf: "EXCEL से PDF विकल्प",
//     html_to_pdf: "HTML से PDF विकल्प",
//     pdf_to_word: "PDF से WORD विकल्प",
//     pdf_to_excel: "PDF से EXCEL विकल्प",
//     pdf_to_pdf_a: "PDF से PDF/A विकल्प",
//     pdf_to_text: "पीडीएफ से टेक्स्ट विकल्प",
//   },
//   loader_text: "कृपया प्रतीक्षा करें...",
//   add_more_button: "अधिक फ़ाइलें जोड़ें",
//   action_buttons: {
//     merge_pdf: "पीडीएफ विलय करें",
//     split_pdf: "पीडीएफ विभाजित करें",
//     compress_pdf: "पीडीएफ संपीड़ित करें",
//     pdf_to_powerpoint: "पावरपॉइंट में रूपांतरित करें",
//     word_to_pdf: "पीडीएफ में रूपांतरित करें",
//     powerpoint_to_pdf: "पीडीएफ में रूपांतरित करें",
//     excel_to_pdf: "पीडीएफ में रूपांतरित करें",
//     html_to_pdf: "पीडीएफ में रूपांतरित करें",
//     pdf_to_word: "वर्ड में रूपांतरित करें",
//     pdf_to_excel: "एक्सेल में रूपांतरित करें",
//     pdf_to_pdf_a: "पीडीएफ ए के लिए रूपांतरित करें",
//     pdf_to_text: "टेक्स्ट में कनवर्ट करें",
//     translate_pdf: "PDF अनुवाद करें",
//   },
//   pages: "पृष्ठों",
//   page: "पृष्ठ",

//   compress_pdf: [
//     {
//       title: "सिफारिश की गई कम्प्रेशन",
//       description: "आकार और गुणवत्ता के बीच सर्वश्रेष्ठ संतुलन",
//     },
//     {
//       title: "कम कम्प्रेशन",
//       description: "छोटी फ़ाइल आकार लेकिन कम गुणवत्ता",
//     },
//     {
//       title: "अत्यधिक कम्प्रेशन",
//       description: "भारी रूप से छोटी फ़ाइल आकार लेकिन बहुत कम गुणवत्ता",
//     },
//     {
//       title: "कस्टम कम्प्रेशन",
//       description: "अपनी पसंद के अनुसार कम्प्रेशन चुनें",
//     },
//   ],
//   pdf_a_options: {
//     info: "नीचे दिए गए ड्रॉपडाउन मेनू से वांछित PDF/A प्रारूप चुनें ताकि आप अपने PDF को परिवर्तित कर सकें। यह सुनिश्चित करेगा कि दस्तावेज़ चुने गए अभिलेखीय मानक के अनुरूप हो।",
//     placeholder: "PDF/A प्रारूप चुनें"
//   },
//   merge_pdf:
//     "मिलाने के लिए पीडीएफ फ़ाइलों के क्रम बदलने के लिए ड्रैग एंड ड्रॉप का उपयोग करें। एक फ़ाइल पर क्लिक और   होल्ड करें, इसे इच्छित स्थान पर ले जाएँ और माउस बटन को छोड़ दें।   पीडीएफ फ़ाइलें ऊपर से नीचे तक मिलाई जाती हैं। फ़ाइल को हटाने के लिए, फ़ाइल के ऊपर हटाने वाले आइकन पर क्लिक करें। पृष्ठ को घुमाने के लिए, पृष्ठ थंबनेल के ऊपर घुमाने वाले आइकन पर क्लिक करें   और चयनित घुमाने का कोण चुनें। एक बार जब फाइल इच्छित क्रम और अभिविन्यास में हो जाती हैं, तो उन्हें एक सिंगल पीडीएफ फ़ाइल में जोड़ने के लिए 'मर्ज' बटन पर क्लिक करें।",
// };

// export const tools: _tools = {
//   select: "चुनें",
//   or_drop: "या फ़ाइलें यहां छोड़ें",
//   files: "फाइलें",
//   drop_files: "फ़ाइलें यहाँ खींचें",
// };

// export const footer: _footer = {
//   brand: "PDFEquips",
//   terms: "शर्तें",
//   conditions: "उपयोग की शर्तें",
//   privacy_policy: "गोपनीयता नीति",
// };

// export const errors: _errors = {
//   EMPTY_FILE: {
//     message: "फ़ाइल खाली है। कृपया एक मान्य फ़ाइल चुनें।",
//     code: "ERR_EMPTY_FILE",
//   },
//   FILE_TOO_LARGE: {
//     message:
//       "फ़ाइल बहुत बड़ी है। कृपया एक छोटी फ़ाइल चुनें या हमारा कंप्रेस-पीडीएफ़ उपकरण उपयोग करके फ़ाइल का आकार कम करें।",
//     code: "ERR_FILE_SIZE_LIMIT_EXCEEDED",
//   },
//   NOT_SUPPORTED_TYPE: {
//     message: "फ़ाइल एक समर्थित प्रकार नहीं है।",
//     types: {
//       PDF: "कृपया एक मान्य पीडीएफ़फ़ाइल चुनें।",
//       DOC: "कृपया एक मान्य वर्ड दस्तावेज़ फ़ाइल चुनें।",
//       DOCX: "कृपया एक मान्य वर्ड दस्तावेज़ फ़ाइल चुनें।",
//       XLS: "कृपया एक मान्य एक्सेल स्प्रेडशीट फ़ाइल चुनें।",
//       XLSX: "कृपया एक मान्य एक्सेल स्प्रेडशीट फ़ाइल चुनें।",
//       PPT: "कृपया एक मान्यपावरपॉइंट प्रस्तुति फ़ाइल चुनें।",
//       PPTX: "कृपया एक मान्य पावरपॉइंट प्रस्तुति फ़ाइल चुनें।",
//     },
//     code: "ERR_INVALID_FILE_TYPE",
//   },
//   FILE_CORRUPT: {
//     message:
//       "फ़ाइल का डाटा भ्रष्ट है और इसे प्रसंस्करण नहीं किया जा सकता है। कृपया एक मान्य फ़ाइल चुनें।",
//     code: "ERR_FILE_CORRUPT",
//   },
//   MISSING_FONTS: {
//     message:
//       "फ़ाइल में फ़ॉन्ट गुम हैं। कृपया सुनिश्चित करें कि पीडीएफफ़ाइल में सभी फ़ॉन्ट एम्बेड हैं।",
//     code: "ERR_MISSING_FONTS",
//   },
//   INVALID_IMAGE_DATA: {
//     message:
//       "फ़ाइल में अवैध छवि डेटा है। कृपया सुनिश्चित करें कि सभी छवियाँ सही ढंग से फ़ॉर्मेटेड हैं।",
//     code: "ERR_INVALID_IMAGE_DATA",
//   },
//   SECURITY_RISK: {
//     message:
//       "फ़ाइल में सुरक्षा जोखिम हो सकता है और इसे प्रसंस्करण नहीं किया जा सकता है। कृपया एक मान्य फ़ाइल चुनें।",
//     code: "ERR_SECURITY_RISK",
//   },
//   MAX_FILES_EXCEEDED: {
//     message:
//       "आपने अनुमति दी हुई अधिकतम फ़ाइलों की संख्या पार कर दी है। कृपया कुछ फ़ाइलें हटाएं और पुनः प्रयास करें।",
//     code: "ERR_MAX_FILES_EXCEEDED",
//   },
//   NO_FILES_SELECTED: {
//     message: "कोई फ़ाइल चयनित नहीं की गई है। कृपया कम से कम एक फ़ाइल चुनें।",
//     code: "ERR_NO_FILES_SELECTED",
//   },
//   UNKNOWN_ERROR: {
//     message:
//       "एक अज्ञात त्रुटि हुई है। कृपया बाद में पुनः प्रयास करें या सहायता से संपर्क करें।",
//     code: "ERR_UNKNOWN",
//   },
//   ERR_NETWORK: {
//     message:
//       "नेटवर्क में त्रुटि हो गई है। कृपया अपना इंटरनेट कनेक्शन जांचें और पुनः प्रयास करें।",
//     code: "ERR_NETWORK",
//   },

//   ERR_UPLOAD_COUNT: {
//     message: "कृपया फ्यूजन करने के लिए कम से कम दो फ़ाइलें अपलोड करें।",
//     code: "ERR_UPLOAD_COUNT",
//   },
// };
