// import type {
//   tool as _tool,
//   web2pdftool as _web2pdftool,
//   tools as _tools,
//   edit_page as _edit_page,
//   footer as _footer,
//   errors as _errors,
//   downloadFile as _downloadFile,
//   landing_page as _landing_page,
// } from "../content";

// export const landing_page: _landing_page = {
//   hero: {
//     title: "عزز إنتاجيتك من خلال حل ال PDF الشامل الخاص بنا",
//     description: `ارتقِ بسير عمل PDF إلى المستوى التالي - أطلق العنان لإمكانيات جديدة باستخدام مجموعة الأدوات الشاملة الخاصة بنا.`,
//   },
//   features: {
//     title: "كيف يمكن لـ PDFEquips تبسيط مهام PDF الخاصة بك",
//     description:
//       "يوفر لك PDFEquips مجموعة من الميزات للتعامل مع ملفات PDF الخاصة بك بسهولة. سواء أكنت تريد دمج أو تقسيم أو ضغط أو تحويل أو تحرير أو حماية ملفات PDF الخاصة بك ، يمكنك القيام بكل ذلك ببضع نقرات فقط. PDFEquips سريع وموثوق وآمن.",
//   },
//   why_us: {
//     title: "الحل الأمثل لملفات PDF",
//     description:
//       "PDFEquips هو تطبيق الويب الأمثل لإدارة ملفات PDF بسهولة. استمتع بجميع\
//     الميزات التي تحتاجها للعمل بفعالية مع مستنداتك الرقمية\
//     مع الحفاظ على أمان وخصوصية بياناتك.",
//   },
//   // alert: {
//   //   title: "ما رأيك في مشاهدة PDFEquips باللغة الإنجليزية؟",
//   //   dontShowAgain: "لا تظهر هذا مرة أخرى",
//   // },
// };

// export const tool: _tool = {
//   Merge_PDF: {
//     title: "دمج PDF",
//     seoTitle: "دمج ملفات PDF عبر الإنترنت - أداة دمج مجانية",
//     description: "دمج ملفات PDF متعددة في مستند واحد",
//     color: "var(--red)",
//     type: ".pdf",
//     to: "/merge-pdf",
//     features: [
//       {
//         title: "مجاني تمامًا وبدون تسجيل",
//         description: "PDFEquips يقدم خدمة دمج ملفات PDF عبر الإنترنت مجانًا. ليس من الضروري إنشاء حساب، ونحن لا نطلب أبدًا عنوان بريدك الإلكتروني أو معلومات بطاقة الائتمان الخاصة بك"
//       },
//       {
//         title: "أداة قوية لدمج ملفات PDF",
//         description: "PDFEquips يجمع بسهولة بين مستندات PDF اثنين أو أكثر في ملف واحد، سواء كانت صفحة واحدة أو صفحات متعددة، ملفات PDF كبيرة أو صغيرة، جميع الصيغ متوافقة"
//       },
//       {
//         title: "دمج ملفات PDF عبر الإنترنت بشكل آمن",
//         description: "جميع الملفات التي تقوم بتحميلها وإنشائها على خوادمنا مشفرة لأسباب أمنية باستخدام TLS. سيتم حذفها فورًا وبشكل دائم بعد الاكتمال. لمزيد من المعلومات، يرجى الرجوع إلى سياسة الخصوصية الخاصة بنا"
//       }
//     ],
//     keywords: "دمج PDF, أدوات دمج PDF, دمج ملفات PDF, دمج مستندات PDF, دمج PDF عبر الإنترنت, دمج PDF بدون تسجيل, دمج PDF مجانًا, دمج ملفات PDF متعددة, دمج PDF بسرعة, دمج PDF بأمان, دمج مستندات PDF بسهولة, دمج PDF عبر الإنترنت مجانًا, دمج PDF بدون تثبيت, دمج ملفات PDF مشفرة, أدوات دمج PDF مجانًا, دمج PDF عبر الإنترنت بدون تسجيل"
//   },
//   Compress_PDF: {
//     title: "ضغط PDF",
//     seoTitle: "ضغط ملفات PDF عبر الإنترنت - أداة تقليل الحجم مجاناً",
//     description: "تقليل حجم ملف PDF مع الحفاظ على الجودة",
//     color: "var(--green)",
//     type: ".pdf",
//     to: "/compress-pdf",
//     features: [
//       {
//         title: "ضغط PDF متعدد الاستخدامات",
//         description: "احصل على نتائج سريعة وموثوقة يمكنك الاعتماد عليها في كل مرة، اختر من مجموعة من مستويات الضغط لضبط حجم ملفك دون التأثير على جودة الوثيقة"
//       },
//       {
//         title: "لا حاجة للتسجيل بالبريد الإلكتروني",
//         description: "ابدأ في ضغط ملفات PDF الخاصة بك على الفور - لا تسجيل بالبريد الإلكتروني، ولا حاجة لتفاصيل بطاقة الائتمان فقط قم بتحميل مستندك وضغطه حسب الحاجة"
//       },
//       {
//         title: "الحفاظ على الجودة في كل الأوقات",
//         description: "يستخدم PDFEquips تقنية متقدمة لتحسين حجم وجودة الصور في ملفات PDF الخاصة بك، مما يضمن أن تحقق أحجام ملفات أصغر بشكل كبير دون المساس بجودة وثائقك"
//       }
//     ],
//     keywords: "ضغط PDF, أدوات ضغط PDF, تقليل حجم PDF, ضغط مستندات PDF, ضغط PDF عبر الإنترنت, ضغط PDF بدون تسجيل, ضغط PDF مجانًا, تقليل حجم ملفات PDF, ضغط PDF بسرعة, ضغط PDF بجودة عالية, ضغط PDF بدون فقدان الجودة, ضغط مستندات PDF عبر الإنترنت, ضغط PDF بدون تثبيت, أدوات ضغط PDF مجانًا, ضغط PDF عبر الإنترنت بدون تسجيل"
//   },
//   PDF_to_Powerpoint: {
//     title: "PDF إلى PowerPoint",
//     seoTitle: "تحويل PDF إلى PowerPoint - أداة تحويل مجانية",
//     description: "تحويل ملفات PDF إلى عروض Powerpoint قابلة للتحرير",
//     color: "#C13B1B",
//     type: ".pdf",
//     to: "/pdf-to-powerpoint",
//     features: [
//       {
//         title: "تحويل PDF إلى PowerPoint بنقرة واحدة",
//         description: "قم بتحويل مستندات PDF إلى عروض تقديمية PowerPoint بسرعة باستخدام محولنا عبر الإنترنت، مما يضمن سهولة المشاركة والتخزين. الحفاظ على التنسيق الأصلي وتخطيط جميع الشرائح."
//       },
//       {
//         title: "تحويل PDF إلى PowerPoint بسرعة ومجانًا",
//         description: "يحول PDFEquips ملفات PDF إلى تنسيق PowerPoint PPT (ppt أو pptx) في ثوانٍ معدودة. بالإضافة إلى ذلك، إنه أداة مجانية تمامًا عبر الإنترنت لا تتطلب أي تثبيت أو تسجيل، ولا تحتوي على علامات مائية."
//       },
//       {
//         title: "تحويل بسيط من PDF إلى PowerPoint",
//         description: "مع محولنا من PDF إلى PowerPoint، لا تحتاج إلى التنقل في الإعدادات والخيارات. فقط قم بتحميل الملف، واسترخ، واستمتع بالعرض!"
//       }
//     ],
//     keywords: "PDF إلى PowerPoint, تحويل PDF إلى PowerPoint, تحويل PDF إلى PPT, تحويل PDF إلى PPTX, أدوات تحويل PDF إلى PowerPoint, تحويل مستندات PDF إلى PowerPoint, تحويل PDF إلى عرض تقديمي, تحويل PDF عبر الإنترنت, تحويل PDF إلى PowerPoint مجانًا, تحويل PDF إلى PPT بدون تسجيل, تحويل PDF بسرعة, تحويل PDF بدون علامات مائية, أدوات تحويل PDF إلى PowerPoint عبر الإنترنت"
//   },
//   WORD_to_PDF: {
//     title: "WORD إلى PDF",
//     seoTitle: "تحويل Word إلى PDF - أداة تحويل مجانية",
//     description: "تحويل ملفات Microsoft Word إلى مستندات PDF",
//     color: "#1B5EBE",
//     type: ".docx",
//     to: "/word-to-pdf",
//     features: [
//       {
//         title: "سهل الاستخدام",
//         description: "بغض النظر عن دورك - سواء كنت عاملاً أو طالبًا أو معلمًا - فإن أدواتنا لمعالجة ملفات PDF سهلة الاستخدام. تحويل ملفات WORD إلى مستندات PDF بسيط ويتطلب فقط بضع نقرات."
//       },
//       {
//         title: "تحويل بسيط وسريع",
//         description: "بفضل طريقته المتقدمة في الحفاظ على التخطيطات والأنماط الأصلية، يضمن PDFEquips تحويلات سلسة من WORD إلى PDF. استمتع بعمليات سريعة دون المساس بسلامة الوثيقة."
//       },
//       {
//         title: "تحويل ملف WORD واحد أو ملفات WORD متعددة",
//         description: "يمكنك بسهولة تحويل ملف WORD واحد أو عدة ملفات WORD بدون عناء باستخدام PDFEquips. تضمن أدواتنا المباشرة تحويلًا سريعًا ودقيقًا، مما يوفر لك الوقت والجهد."
//       }
//     ],
//     keywords: "WORD إلى PDF, تحويل WORD إلى PDF, تحويل مستندات Word إلى PDF, تحويل ملفات Word إلى PDF, أدوات تحويل Word إلى PDF, تحويل Word إلى PDF عبر الإنترنت, تحويل Word إلى PDF مجانًا, تحويل Word بسرعة, تحويل Word بدون تسجيل, تحويل Word إلى PDF بدون فقدان التنسيق, تحويل مستندات Word إلى PDF بسهولة, تحويل ملفات Word إلى PDF بدون تثبيت, أدوات تحويل Word إلى PDF مجانًا"
//   },
//   POWERPOINT_to_PDF: {
//     title: "POWERPOINT إلى PDF",
//     seoTitle: "تحويل PowerPoint إلى PDF - أداة تحويل مجانية",
//     description: "تحويل ملفات Microsoft Powerpoint إلى مستندات PDF",
//     color: "#C13B1B",
//     type: ".pptx",
//     to: "/powerpoint-to-pdf",
//     features: [
//       {
//         title: "تحويل PowerPoint إلى PDF بنقرة واحدة",
//         description: "قم بتحويل عروض PowerPoint إلى مستندات PDF بسرعة باستخدام محولنا عبر الإنترنت، مما يضمن سهولة المشاركة والتخزين. الحفاظ على التنسيق الأصلي وتخطيط جميع الشرائح."
//       },
//       {
//         title: "تحويل PowerPoint إلى PDF بسرعة ومجانًا",
//         description: "يحول PDFEquips ملفات PowerPoint PPT (ppt أو pptx) إلى PDF في ثوانٍ معدودة. بالإضافة إلى ذلك، إنه أداة مجانية تمامًا عبر الإنترنت لا تتطلب أي تثبيت أو تسجيل، ولا تحتوي على علامات مائية."
//       },
//       {
//         title: "تحويل بسيط من PowerPoint إلى PDF",
//         description: "مع محولنا من PPT إلى PDF، لا تحتاج إلى التنقل في الإعدادات والخيارات. فقط قم بتحميل الملف، واسترخ، واستمتع بالعرض!"
//       }
//     ],
//     keywords: "POWERPOINT إلى PDF, تحويل PowerPoint إلى PDF, تحويل مستندات PowerPoint إلى PDF, تحويل عروض PowerPoint إلى PDF, أدوات تحويل PowerPoint إلى PDF, تحويل PowerPoint إلى PDF عبر الإنترنت, تحويل PowerPoint إلى PDF مجانًا, تحويل PowerPoint بسرعة, تحويل PowerPoint بدون تسجيل, تحويل PowerPoint إلى PDF بدون فقدان التنسيق, تحويل عروض PowerPoint إلى PDF بسهولة, تحويل ملفات PowerPoint إلى PDF بدون تثبيت, أدوات تحويل PowerPoint إلى PDF مجانًا"
//   },
//   EXCEL_to_PDF: {
//     title: "EXCEL إلى PDF",
//     seoTitle: "تحويل Excel إلى PDF - أداة تحويل مجانية",
//     description: "تحويل ملفات Microsoft Excel إلى مستندات PDF",
//     color: "#10793F",
//     type: ".xlsx",
//     to: "/excel-to-pdf",
//     features: [
//       {
//         title: "محول سهل الاستخدام من Excel إلى PDF",
//         description: "محول مناسب لتحويل ملفات XLS و XLSX إلى تنسيق PDF يجعل من السهل مشاركتها وتخزينها بأمان. حافظ على بياناتك من التغييرات واستمتع بالوصول إلى ملفات Excel الخاصة بك على أي جهاز، سواء كان لديك Microsoft Office أم لا."
//       },
//       {
//         title: "أداة تحويل سريعة ومجانية عبر الإنترنت",
//         description: "PDFEquips هي أداة عبر الإنترنت مجانية تمامًا لتحويل ملفات Excel (xls أو xlsx) إلى PDF. لا يتطلب التثبيت أو التسجيل، ولا تضاف علامات مائية. بالإضافة إلى ذلك، فإنه يحول ملفات Excel الكبيرة في ثوانٍ معدودة."
//       },
//       {
//         title: "تحويل آمن من XLS إلى PDF",
//         description: "تحمي ملفاتك بتشفير TLS القوي (أمان الطبقة النقل)، وتُحذف جميع ملفات Excel وPDF تلقائيًا من خوادمنا بعد مرور ساعة واحدة. لمزيد من المعلومات، يرجى الرجوع إلى سياسة الخصوصية الخاصة بنا."
//       }
//     ],
//     keywords: "EXCEL إلى PDF, تحويل Excel إلى PDF, تحويل مستندات Excel إلى PDF, تحويل ملفات Excel إلى PDF, أدوات تحويل Excel إلى PDF, تحويل Excel إلى PDF عبر الإنترنت, تحويل Excel إلى PDF مجانًا, تحويل Excel بسرعة, تحويل Excel بدون تسجيل, تحويل Excel إلى PDF بدون فقدان التنسيق, تحويل جداول Excel إلى PDF بسهولة, تحويل ملفات Excel إلى PDF بدون تثبيت, أدوات تحويل Excel إلى PDF مجانًا"
//   },
//   HTML_to_PDF: {
//     title: "HTML إلى PDF",
//     seoTitle: "تحويل HTML إلى PDF - أداة تحويل مجانية",
//     description: "تحويل صفحات الويب HTML إلى مستندات PDF",
//     color: "rgb(228, 77, 38)",
//     type: ".html",
//     to: "/html-to-pdf",
//     features: [
//       {
//         title: "التحويل فوري، لا حاجة للتسجيل.",
//         description: "لا حاجة للتسجيل أو تقديم أي معلومات لتحويل HTML الخاص بك إلى PDF. محولنا مجاني للجميع ويقدم نتائج سريعة."
//       },
//       {
//         title: "إدارة آمنة للمستندات.",
//         description: "يتم معالجة تنزيلاتك وملفات PDF المُنشأة بتشفير TLS لضمان الأمان الإضافي. كن على يقين أن خصوصية بياناتك محمية. تحقق من سياسة الخصوصية الخاصة بنا لمزيد من المعلومات."
//       },
//       {
//         title: "معالجة قائمة على السحابة.",
//         description: "تمتع براحة معالجة قائمة على السحابة لتحويل HTML إلى PDF. يضمن خدمتنا عبر الإنترنت تحويلًا سريعًا وفعالًا دون إبطاء جهاز الكمبيوتر الخاص بك. احصل على الوصول إلى خدمتنا من أي مكان وفي أي وقت."
//       }
//     ],
//     keywords: "HTML إلى PDF, تحويل HTML إلى PDF, تحويل صفحات الويب إلى PDF, تحويل ملفات HTML إلى PDF, أدوات تحويل HTML إلى PDF, تحويل HTML إلى PDF عبر الإنترنت, تحويل HTML إلى PDF مجانًا, تحويل HTML بسرعة, تحويل HTML بدون تسجيل, تحويل صفحات الويب إلى PDF بدون فقدان التنسيق, تحويل HTML إلى مستندات PDF بسهولة, تحويل ملفات HTML إلى PDF بدون تثبيت, أدوات تحويل HTML إلى PDF مجانًا"
//   },
//   PDF_to_WORD: {
//     title: "PDF إلى WORD",
//     seoTitle: "تحويل PDF إلى Word - أداة تحويل مجانية",
//     description: "تحويل ملفات PDF إلى مستندات Microsoft Word",
//     color: "#1B5EBE",
//     type: ".pdf",
//     to: "/pdf-to-word",
//     features: [
//       {
//         title: "تحويل بسيط وسريع",
//         description: "بفضل طريقته المتقدمة في الحفاظ على التخطيطات والأنماط الأصلية، يضمن PDFEquips تحويلات سلسة من PDF إلى Word. استمتع بعمليات سريعة دون المساس بسلامة الوثيقة."
//       },
//       {
//         title: "سهل الاستخدام",
//         description: "بغض النظر عن دورك - سواء كنت عاملاً أو طالبًا أو معلمًا - فإن أدواتنا لمعالجة ملفات PDF سهلة الاستخدام. تحويل ملفات PDF إلى مستندات Word بسيط ويتطلب فقط بضع نقرات."
//       },
//       {
//         title: "تحويل ملف PDF واحد أو ملفات PDF متعددة",
//         description: "يمكنك بسهولة تحويل ملف PDF واحد أو عدة ملفات PDF بدون عناء باستخدام PDFEquips. تضمن أدواتنا المباشرة تحويلًا سريعًا ودقيقًا، مما يوفر لك الوقت والجهد."
//       }
//     ],
//     keywords: "PDF إلى WORD, تحويل PDF إلى Word, تحويل مستندات PDF إلى Word, تحويل ملفات PDF إلى Word, أدوات تحويل PDF إلى Word, تحويل PDF إلى Word عبر الإنترنت, تحويل PDF إلى Word مجانًا, تحويل PDF بسرعة, تحويل PDF بدون تسجيل, تحويل PDF إلى Word بدون فقدان التنسيق, تحويل مستندات PDF إلى Word بسهولة, تحويل ملفات PDF إلى Word بدون تثبيت, أدوات تحويل PDF إلى Word مجانًا"
//   },
//   PDF_to_EXCEL: {
//     title: "PDF إلى EXCEL",
//     seoTitle: "تحويل PDF إلى Excel - أداة تحويل مجانية",
//     description: "تحويل ملفات PDF إلى مستندات Microsoft Excel",
//     color: "#10793F",
//     type: ".pdf",
//     to: "/pdf-to-excel",
//     features: [
//       {
//         title: "أداة تحويل عبر الإنترنت سريعة ومجانية",
//         description: "PDFEquips هو أداة عبر الإنترنت مجانية تمامًا لتحويل ملفات PDF إلى Excel (XLS أو XLSX). لا يتطلب التثبيت أو التسجيل، ولا يتم إضافة علامات مائية. بالإضافة إلى ذلك، فإنه يحول ملفات PDF الكبيرة في ثوانٍ معدودة."
//       },
//       {
//         title: "محول سهل الاستخدام من PDF إلى Excel",
//         description: "محول مناسب لتحويل ملفات PDF إلى تنسيق XLS أو XLSX يجعل من السهل مشاركتها وتخزينها بأمان. حافظ على بياناتك من التغييرات واستمتع بالوصول إلى ملفات Excel الخاصة بك على أي جهاز، سواء كان لديك Microsoft Office أم لا."
//       },
//       {
//         title: "تحويل آمن من PDF إلى XLS",
//         description: "تحمي ملفاتك بتشفير TLS القوي (أمان الطبقة النقل)، وتُحذف جميع ملفات PDF وExcel تلقائيًا من خوادمنا بعد مرور ساعة واحدة. لمزيد من المعلومات، يرجى الرجوع إلى سياسة الخصوصية الخاصة بنا."
//       }
//     ],
//     keywords: "PDF إلى EXCEL, تحويل PDF إلى Excel, تحويل مستندات PDF إلى Excel, تحويل ملفات PDF إلى Excel, أدوات تحويل PDF إلى Excel, تحويل PDF إلى Excel عبر الإنترنت, تحويل PDF إلى Excel مجانًا, تحويل PDF بسرعة, تحويل PDF بدون تسجيل, تحويل PDF إلى Excel بدون فقدان التنسيق, تحويل جداول PDF إلى Excel بسهولة, تحويل ملفات PDF إلى Excel بدون تثبيت, أدوات تحويل PDF إلى Excel مجانًا"
//   },
//   PDF_to_PDF_A: {
//     title: "PDF إلى PDF/A",
//     seoTitle: "تحويل PDF إلى PDF/A - أداة أرشفة مجانية",
//     description: "تحويل ملفات PDF إلى تنسيق PDF/A للأرشفة على المدى الطويل",
//     color: "#000000",
//     type: ".pdf",
//     to: "/pdf-to-pdf-a",
//     features: [
//       {
//         title: "الحفاظ على سلامة الوثائق",
//         description: "قم بتحويل ملفات PDF الخاصة بك إلى تنسيق PDF/A وتأكد من الحفاظ على سلامة الوثيقة، بما في ذلك المحتوى والهيكل والمظهر"
//       },
//       {
//         title: "الامتثال لمعايير الأرشفة",
//         description: "تأكد من الامتثال لمعايير الأرشفة من خلال تحويل مستنداتك الـ PDF إلى تنسيق PDF/A، الذي يعتبر مناسبًا للتخزين على المدى الطويل والمتطلبات القانونية"
//       },
//       {
//         title: "الوصولية والتوافقية على المدى الطويل",
//         description: "من خلال تحويل ملفاتك الـ PDF إلى تنسيق PDF/A، تضمن الوصولية والتوافقية على المدى الطويل مع البرمجيات والأنظمة المستقبلية، مع تقليل مخاطر عدم التوافق مع التنسيقات"
//       }
//     ],
//     keywords: "PDF إلى PDF/A, تحويل PDF إلى PDF/A, تحويل مستندات PDF إلى PDF/A, تحويل ملفات PDF إلى PDF/A, أدوات تحويل PDF إلى PDF/A, تحويل PDF إلى PDF/A عبر الإنترنت, تحويل PDF إلى PDF/A مجانًا, تحويل PDF بسرعة, تحويل PDF بدون تسجيل, تحويل PDF إلى PDF/A بدون فقدان التنسيق, تحويل مستندات PDF إلى PDF/A بسهولة, تحويل ملفات PDF إلى PDF/A بدون تثبيت, أدوات تحويل PDF إلى PDF/A مجانًا"
//   },
//   PDF_to_Text: {
//     title: "تحويل PDF إلى نص",
//     seoTitle: "تحويل PDF إلى نص - أداة تحويل مجانية",
//     description: "تحويل ملفات PDF إلى مستندات نصية عادية",
//     color: "#4493e1",
//     type: ".pdf",
//     to: "/pdf-to-text",
//     features: [
//       {
//         title: "تحويل قوي ودقيق",
//         description: "استفد من قدرات التحويل القوية والدقيقة، مما يضمن استخراجًا عالي الجودة لمحتوى النص من ملفات PDF، بما في ذلك دعم للعديد من اللغات مثل العربية."
//       },
//       {
//         title: "معالجة سريعة",
//         description: "استمتع بسرعة المعالجة مع محولنا من PDF إلى نص، مما يمكنك من التحويل السريع لملفات PDF إلى تنسيق النص العادي دون المساس بالدقة."
//       },
//       {
//         title: "الحفاظ على هيكل الوثيقة",
//         description: "قم بتحويل ملفات PDF إلى نص عادي مع الحفاظ على هيكل الوثيقة والتنسيق، مما يضمن قراءة واستخدام سهل لمحتوى النص المستخرج."
//       }
//     ],
//     keywords: "تحويل PDF إلى نص, تحويل PDF إلى مستند نصي, تحويل مستندات PDF إلى نص, تحويل ملفات PDF إلى نص, أدوات تحويل PDF إلى نص, تحويل PDF إلى نص عبر الإنترنت, تحويل PDF إلى نص مجانًا, تحويل PDF بسرعة, تحويل PDF بدون تسجيل, تحويل PDF إلى نص بدون فقدان التنسيق, استخراج النص من PDF بسهولة, تحويل ملفات PDF إلى نص بدون تثبيت, أدوات تحويل PDF إلى نص مجانًا"
//   }
// }

// export const tools: _tools = {
//   select: "اختر",
//   or_drop: "أو قم بإسقاط الملفات هنا",
//   files: "ملفات",
//   drop_files: "قم بوضع الملفات هنا",
// };

// export const downloadFile: _downloadFile = {
//   titles: {
//     "merge-pdf": ["تم دمج ملفات ال PDF!", "تم دمج ملف ال PDF!"],
//     "split-pdf": ["تم تقسيم ملف ال PDF!"],
//     "compress-pdf": ["تم ضغط ملفات ال PDF!", "تم ضغط ملف ال PDF!"],
//     "pdf-to-powerpoint": [
//       "تم تحويل ملفات PDF إلى PowerPoint!",
//       "تم تحويل ملف PDF إلى PowerPoint!",
//     ],
//     "word-to-pdf": [
//       "تم تحويل ملفات Word إلى PDF!",
//       "تم تحويل ملف Word إلى PDF!",
//     ],
//     "powerpoint-to-pdf": [
//       "تم تحويل ملفات PowerPoint إلى PDF!",
//       "تم تحويل ملف PowerPoint إلى PDF!",
//     ],
//     "excel-to-pdf": [
//       "تم تحويل ملفات Excel إلى PDF!",
//       "تم تحويل ملف Excel إلى PDF!",
//     ],
//     "html-to-pdf": [
//       "تم تحويل ملفات HTML إلى PDF!",
//       "تم تحويل ملف HTML إلى PDF!",
//     ],
//     "pdf-to-word": [
//       "تم تحويل ملفات PDF إلى Word!",
//       "تم تحويل ملف PDF إلى Word!",
//     ],
//     "pdf-to-excel": [
//       "تم تحويل ملفات PDF إلى Excel!",
//       "تم تحويل ملف PDF إلى Excel!",
//     ],
//     "pdf-to-pdf-a": [
//       "تم تحويل ملفات PDF إلى PDF/A!",
//       "تم تحويل ملف PDF إلى PDF/A!",
//     ],
//     "pdf-to-text": ["تم تحويل ملفات PDF إلى نص!", "تم تحويل ملف PDF إلى نص!"],
//   },
//   btnText: {
//     "merge-pdf": ["تحميل ملفات PDF المدموجة", "تحميل ملف PDF مدموج"],
//     "split-pdf": ["تحميل ملفات PDF المقسمة", "تحميل ملف PDF مقسم"],
//     "compress-pdf": ["تحميل ملفات PDF المضغوطة", "تحميل ملف PDF مضغوط"],
//     "pdf-to-powerpoint": [
//       "تحميل ملفات PowerPoint المحولة",
//       "تحميل ملف PowerPoint المحول",
//     ],
//     "word-to-pdf": ["تحميل ملفات PDF المحولة", "تحميل ملف PDF المحول"],
//     "powerpoint-to-pdf": ["تحميل ملفات PDF المحولة", "تحميل ملف PDF المحول"],
//     "excel-to-pdf": ["تحميل ملفات PDF المحولة", "تحميل ملف PDF المحول"],
//     "html-to-pdf": ["تحميل ملفات PDF المحولة", "تحميل ملف PDF المحول"],
//     "pdf-to-word": ["تحميل ملفات Word المحولة", "تحميل ملف Word المحول"],
//     "pdf-to-excel": ["تحميل ملفات Excel المحولة", "تحميل ملف Excel المحول"],
//     "pdf-to-pdf-a": ["تحميل ملفات PDF/A المحولة", "تحميل ملف PDF/A المحول"],
//     "pdf-to-text": ["تحميل ملفات النص المحولة", "تحميل ملف النص المحول"],
//   },
//   backto: {
//     "merge-pdf": "العودة إلى دمج ملفات PDF",
//     "split-pdf": "العودة إلى تقسيم ملفات PDF",
//     "compress-pdf": "العودة إلى ضغط ملفات PDF",
//     "pdf-to-powerpoint": "العودة إلى PDF إلى باوربوينت",
//     "word-to-pdf": "العودة إلى Word إلى PDF",
//     "powerpoint-to-pdf": "العودة إلى باوربوينت إلى PDF",
//     "excel-to-pdf": "العودة إلى Excel إلى PDF",
//     "html-to-pdf": "العودة إلى HTML إلى PDF",
//     "pdf-to-word": "العودة إلى PDF إلى Word",
//     "pdf-to-excel": "العودة إلى PDF إلى Excel",
//     "pdf-to-pdf-a": "العودة إلى PDF إلى PDF-A",
//     "pdf-to-text": "العودة إلى PDF إلى النص",
//   },
// };

// export const edit_page: _edit_page = {
//   edit_page_titles: {
//     merge_pdf: "خيارات دمج ملف PDF",
//     split_pdf: "خيارات تقسيم ملف PDF",
//     compress_pdf: "خيارات ضغط ملف PDF",
//     pdf_to_powerpoint: "خيارات تحويل ملف PDF إلى باوربوينت",
//     word_to_pdf: "خيارات تحويل ملف WORD إلى PDF",
//     powerpoint_to_pdf: "خيارات تحويل ملف POWERPOINT إلى PDF",
//     excel_to_pdf: "خيارات تحويل ملف EXCEL إلى PDF",
//     html_to_pdf: "خيارات تحويل ملف HTML إلى PDF",
//     pdf_to_word: "خيارات تحويل ملف PDF إلى WORD",
//     pdf_to_excel: "خيارات تحويل ملف PDF إلى EXCEL",
//     pdf_to_pdf_a: "خيارات تحويل ملف PDF إلى PDF/A",
//     pdf_to_text: "خيارات تحويل PDF إلى نص",
//   },
//   loader_text: "يرجى الانتظار...",
//   add_more_button: "إضافة المزيد من الملفات",
//   action_buttons: {
//     merge_pdf: "دمج PDF",
//     split_pdf: "تقسيم PDF",
//     compress_pdf: "ضغط PDF",
//     translate_pdf: "ترجمة PDF",
//     pdf_to_powerpoint: "تحويل إلى Powerpoint",
//     word_to_pdf: "تحويل إلى PDF",
//     powerpoint_to_pdf: "تحويل إلى PDF",
//     excel_to_pdf: "تحويل إلى PDF",
//     html_to_pdf: "تحويل إلى PDF",
//     pdf_to_word: "تحويل إلى Word",
//     pdf_to_excel: "تحويل إلى Excel",
//     pdf_to_pdf_a: "تحويل إلى PDF/A",
//     pdf_to_text: "تحويل إلى نص",
//   },
//   pages: "صفحات",
//   page: "صفحة واحدة",
//   compress_pdf: [
//     {
//       title: "ضغط مُستَحسَن",
//       description: "أفضل توازن بين الحجم والجودة",
//     },
//     {
//       title: "ضغط أقل",
//       description: "حجم ملف أصغر ولكن جودة أقل",
//     },
//     {
//       title: "ضغط شديد",
//       description: "حجم ملف أصغر بشكل كبير ولكن جودة أقل بكثير",
//     },
//     {
//       title: "ضغط مخصص",
//       description: "اختيار كمية الضغط الخاصة بك",
//     },
//   ],
//   pdf_a_options: {
//     info: "اختر تنسيق PDF/A المطلوب من القائمة المنسدلة أدناه لتحويل ملف PDF الخاص بك. سيساهم ذلك في ضمان توافق الوثيقة مع المعيار الأرشيفي المحدد.",
//     placeholder: "اختر تنسيق PDF/A"
//   },
//   merge_pdf: `استخدم السحب والإفلات لتغيير ترتيب ملفات PDF للدمج. انقر واستمر في الضغط على الملف، وانقله إلى الموقع المطلوب، وانترك زر الفأرة.
//   تتم عملية دمج ملفات PDF من الأعلى إلى الأسفل. لإزالة ملف، انقر على أيقونة الحذف في الجزء العلوي من الملف. لتدوير صفحة، انقر على أيقونة الدوران في الجزء العلوي من صورة المصغّرة وحدد زاوية الدوران المطلوبة. بمجرد ترتيب الملفات بالترتيب والاتجاه المطلوبين، انقر على زر "دمج" لدمجها في ملف PDF واحد.
//   `,
// };

// export const footer: _footer = {
//   brand: "PDFEquips",
//   terms: "الشروط",
//   conditions: "والأحكام",
//   privacy_policy: "سياسة الخصوصية",
// };

// export const errors: _errors = {
//   EMPTY_FILE: {
//     message: "الملف فارغ. يرجى اختيار ملف صالح.",
//     code: "ERR_EMPTY_FILE",
//   },
//   FILE_TOO_LARGE: {
//     message:
//       "حجم الملف كبير جدًا. يرجى اختيار ملف أصغر، أو استخدام أداة ضغط PDF الخاصة بنا لتقليل حجم الملف.",
//     code: "ERR_FILE_SIZE_LIMIT_EXCEEDED",
//   },
//   NOT_SUPPORTED_TYPE: {
//     message: "الملف غير مدعوم.",
//     types: {
//       PDF: "يرجى اختيار ملف PDF صالح.",
//       DOC: "يرجى اختيار ملف مستند Word صالح.",
//       DOCX: "يرجى اختيار ملف مستند Word صالح.",
//       XLS: "يرجى اختيار ملف جدول بيانات Excel صالح.",
//       XLSX: "يرجى اختيارملف جدول بيانات Excel صالح.",
//       PPT: "يرجى اختيار ملف عرض تقديمي PowerPoint صالح.",
//       PPTX: "يرجى اختيار ملف عرض تقديمي PowerPoint صالح.",
//     },
//     code: "ERR_INVALID_FILE_TYPE",
//   },
//   FILE_CORRUPT: {
//     message: "الملف تالف ولا يمكن معالجته. يرجى اختيار ملف صالح.",
//     code: "ERR_FILE_CORRUPT",
//   },
//   MISSING_FONTS: {
//     message:
//       "الملف يحتوي على خطوط أحرف مفقودة. يرجى التأكد من تضمين جميع الخطوط في ملف PDF.",
//     code: "ERR_MISSING_FONTS",
//   },
//   INVALID_IMAGE_DATA: {
//     message:
//       "الملف يحتوي على بيانات صورة غير صالحة. يرجى التأكد من تنسيق جميع الصور بشكل صحيح.",
//     code: "ERR_INVALID_IMAGE_DATA",
//   },
//   SECURITY_RISK: {
//     message:
//       "الملف يحتوي على مخاطر أمان ولا يمكن معالجته. يرجى اختيار ملف صالح.",
//     code: "ERR_SECURITY_RISK",
//   },
//   MAX_FILES_EXCEEDED: {
//     message:
//       "لقد تجاوزت الحد الأقصى لعدد الملفات المسموح به. يرجى حذف بعض الملفات والمحاولة مرة أخرى.",
//     code: "ERR_MAX_FILES_EXCEEDED",
//   },
//   NO_FILES_SELECTED: {
//     message: "لم يتم اختيار أي ملفات. يرجى اختيار ملف واحد على الأقل.",
//     code: "ERR_NO_FILES_SELECTED",
//   },
//   UNKNOWN_ERROR: {
//     message:
//       "حدث خطأ غير معروف. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالدعم.",
//     code: "ERR_UNKNOWN",
//   },
//   ERR_NETWORK: {
//     message:
//       "حدث خطأ في الشبكة. يرجى التحقق من اتصالك بالإنترنت وحاول مرة أخرى.",
//     code: "ERR_NETWORK",
//   },
//   ERR_UPLOAD_COUNT: {
//     message: "يرجى رفع ملفين على الأقل للدمج.",
//     code: "ERR_UPLOAD_COUNT",
//   },
// };
